import React from 'react'
import { Link } from 'react-router-dom'

import Hearts from '../components/hearts'

function Question(): React.ReactElement {
    return (
        <main className="ThankPage">
            <div className="container">
                <img src="/peach.gif" className='gif' />

                <h1>Спасибо, моя любимая! ❤️</h1>

                <div className="text">
                    <p>
                        Я знал что ты согласишься на мое предложение! Ты самая лучшая! 🥰
                        Спасибо тебе за всё что ты для меня делаешь. Ты мое счастье и радость! 💍
                        <br />
                        Я очень дорожу тобой и нашей любовью. 💗
                        Я скучаю по тебе каждый день. Люблю тебя очень очень сильно 🌹
                    </p>
                    <p>
                        Я очень старался когда делал этот сайтик, надеюсь тебе понравится! Люблю тебя! 😘
                    </p>
                </div>

                <Link to='/' className="homeLink">Вернуться</Link>
            </div>

            <p className="author">Сделано с 💗 от Кости для Ники</p>

            <Hearts number={(Math.random() * 5 + 15)} /> {/* от 15 до 20 сердечек */}
        </main>
    )
}

export default Question