import React, { useEffect } from 'react'
import { Link, useNavigate } from 'react-router-dom'

import Hearts from '../components/hearts'

function Question(): React.ReactElement {
    const navigate = useNavigate();

    useEffect(() => {
        const agreed = localStorage.getItem('agreed');
        if (!agreed) {
            navigate('/');
        }
    }, [navigate, localStorage.getItem('agreed')]);

    return (
        <main className="ThankPage">
            <div className="container">
                <img src="/peach.gif" className='gif' alt=" " width="40%" />

                <h1>Спасибо, моя любимая! ❤️</h1>

                <div className="text">
                    <p>
                        Я знал что ты согласишься на мое предложение! Ты самая лучшая. 🥰
                        Люблю тебя больше всего на свете! Никогда я не испытывал сколько любви сколько я испытываю к тебе.
                        Если ты когда-нибудь пропадешь из моей жизни, я конечно попытаюсь жить дальше,
                        но в это потеряет всякий смысл. Я даже боюсь представить что будет если ты уйдешь от меня...
                        Очень надеюсь что у нас всё получится и мы будем вместе всегда. Люблю тебя 💗
                    </p>
                    <p>
                        Я очень старался когда делал этот сайтик, надеюсь тебе понравится.
                    </p>
                </div>

                <Link to='/' className="link-btn">Вернуться</Link>
            </div>
            <Hearts number={(Math.random() * 5 + 15)} /> {/* от 15 до 20 сердечек */}
        </main>
    )
}

export default Question